In [1]:
import pandas as pd

In [ ]:
# Joins
# Joins two dataframes based on their indices.
# Can be used to combine data based on inner, outer, left, or right joins.
# Can handle non-matching values in the indices being joined.
# Can handle multiple indices being joined at once.
# The resulting dataframe may have new columns and rows depending on how the join is performed.

In [3]:
left=pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

In [5]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [7]:
right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

In [14]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [ ]:
# By default how=left # how= inner/left/right/outer

In [9]:
right.join(left,how = "left")

     C   D    A    B
K0  C0  D0   A0   B0
K2  C2  D2   A2   B2
K3  C3  D3  NaN  NaN

In [11]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [17]:
left.join(right,how = 'right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [19]:
left.join(right,how = 'inner')

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [21]:
left.join(right,how = 'outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [ ]:
# Null / Blank Values

In [23]:
x=left.join(right,how = 'outer')

In [25]:
x

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [27]:
x.isna()  #Nan --> true

        A      B      C      D
K0  False  False  False  False
K1  False  False   True   True
K2  False  False  False  False
K3   True   True  False  False

In [29]:
x.isna().sum()

A    1
B    1
C    1
D    1
dtype: int64

In [ ]:
# Result.dropna()  # default axis is 0 
 # Drop rows with any null values

In [31]:
x.dropna()

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [33]:
x

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [35]:
x.dropna(axis = 1) # Drop columns with any null values

Empty DataFrame
Columns: []
Index: [K0, K1, K2, K3]

In [37]:
x

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [39]:
x.dropna(thresh = 3)# Drop rows where less than 2 non-null values are present

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [43]:
x.dropna(thresh = 2)

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [45]:
x.dropna(thresh = 4)

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

In [47]:
x.fillna("__")

     A   B   C   D
K0  A0  B0  C0  D0
K1  A1  B1  __  __
K2  A2  B2  C2  D2
K3  __  __  C3  D3

In [55]:
# specific column fill
x["B"].fillna("xx" , inplace = True)

In [57]:
x

      A   B    C    D
K0   A0  B0   C0   D0
K1   A1  B1  NaN  NaN
K2   A2  B2   C2   D2
K3  NaN  xx   C3   D3

In [61]:
x["C"].fillna("yy",inplace = True)

In [63]:
x

      A   B   C    D
K0   A0  B0  C0   D0
K1   A1  B1  yy  NaN
K2   A2  B2  C2   D2
K3  NaN  xx  C3   D3